loidinhm31/c-stm32_controller/Program/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stdint.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CS_I2C_SPI_Pin GPIO_PIN_3
#define CS_I2C_SPI_GPIO_Port GPIOE
#define PC14_OSC32_IN_Pin GPIO_PIN_14
#define PC14_OSC32_IN_GPIO_Port GPIOC
#define PC15_OSC32_OUT_Pin GPIO_PIN_15
#define PC15_OSC32_OUT_GPIO_Port GPIOC
#define PH0_OSC_IN_Pin GPIO_PIN_0
#define PH0_OSC_IN_GPIO_Port GPIOH
#define PH1_OSC_OUT_Pin GPIO_PIN_1
#define PH1_OSC_OUT_GPIO_Port GPIOH
#define OTG_FS_PowerSwitchOn_Pin GPIO_PIN_0
#define OTG_FS_PowerSwitchOn_GPIO_Port GPIOC
#define PDM_OUT_Pin GPIO_PIN_3
#define PDM_OUT_GPIO_Port GPIOC
#define I2S3_WS_Pin GPIO_PIN_4
#define I2S3_WS_GPIO_Port GPIOA
#define SPI1_SCK_Pin GPIO_PIN_5
#define SPI1_SCK_GPIO_Port GPIOA
#define SPI1_MISO_Pin GPIO_PIN_6
#define SPI1_MISO_GPIO_Port GPIOA
#define SPI1_MOSI_Pin GPIO_PIN_7
#define SPI1_MOSI_GPIO_Port GPIOA
#define CLK_IN_Pin GPIO_PIN_10
#define CLK_IN_GPIO_Port GPIOB
#define LD4_Pin GPIO_PIN_12
#define LD4_GPIO_Port GPIOD
#define LD3_Pin GPIO_PIN_13
#define LD3_GPIO_Port GPIOD
#define LD5_Pin GPIO_PIN_14
#define LD5_GPIO_Port GPIOD
#define LD6_Pin GPIO_PIN_15
#define LD6_GPIO_Port GPIOD
#define I2S3_MCK_Pin GPIO_PIN_7
#define I2S3_MCK_GPIO_Port GPIOC
#define VBUS_FS_Pin GPIO_PIN_9
#define VBUS_FS_GPIO_Port GPIOA
#define OTG_FS_ID_Pin GPIO_PIN_10
#define OTG_FS_ID_GPIO_Port GPIOA
#define OTG_FS_DM_Pin GPIO_PIN_11
#define OTG_FS_DM_GPIO_Port GPIOA
#define OTG_FS_DP_Pin GPIO_PIN_12
#define OTG_FS_DP_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define I2S3_SCK_Pin GPIO_PIN_10
#define I2S3_SCK_GPIO_Port GPIOC
#define I2S3_SD_Pin GPIO_PIN_12
#define I2S3_SD_GPIO_Port GPIOC
#define Audio_RST_Pin GPIO_PIN_4
#define Audio_RST_GPIO_Port GPIOD
#define OTG_FS_OverCurrent_Pin GPIO_PIN_5
#define OTG_FS_OverCurrent_GPIO_Port GPIOD
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define Audio_SCL_Pin GPIO_PIN_6
#define Audio_SCL_GPIO_Port GPIOB
#define Audio_SDA_Pin GPIO_PIN_9
#define Audio_SDA_GPIO_Port GPIOB
#define MEMS_INT2_Pin GPIO_PIN_1
#define MEMS_INT2_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

typedef struct {
    uint32_t gpioa_en: 1;
    uint32_t gpiob_en: 1;
    uint32_t gpioc_en: 1;
    uint32_t gpiod_en: 1;
    uint32_t gpioe_en: 1;
    uint32_t gpiof_en: 1;
    uint32_t gpiog_en: 1;
    uint32_t gpioh_en: 1;
    uint32_t gpioi_en: 1;
    uint32_t reserved1: 3;
    uint32_t crc_en: 1;
    uint32_t reserved2: 3;
    uint32_t reserved3: 2;
    uint32_t bkpsram_en: 1;
    uint32_t reserved4: 1;
    uint32_t ccmdat_en: 1;
    uint32_t dma1_en: 1;
    uint32_t dma2_en: 1;
    uint32_t reserved5: 2;
    uint32_t ethmac_en: 1;
    uint32_t ethmactx_en: 1;
    uint32_t ethmacrx_en: 1;
    uint32_t ethmacptp_en: 1;
    uint32_t otghs_en: 1;
    uint32_t otghsulpi_en: 1;
} RCC_AHB1ENR_t;

typedef struct {
    uint32_t pin_0: 1;
    uint32_t pin_1: 1;
    uint32_t pin_2: 1;
    uint32_t pin_3: 1;
    uint32_t pin_4: 1;
    uint32_t pin_5: 1;
    uint32_t pin_6: 1;
    uint32_t pin_7: 1;
    uint32_t pin_8: 1;
    uint32_t pin_9: 1;
    uint32_t pin_10: 1;
    uint32_t pin_11: 1;
    uint32_t pin_12: 1;
    uint32_t pin_13: 1;
    uint32_t pin_14: 1;
    uint32_t pin_15: 1;
    uint32_t reserved: 16;
} GPIOx_ODR_t;

typedef struct {
    uint32_t pin_0: 2;
    uint32_t pin_1: 2;
    uint32_t pin_2: 2;
    uint32_t pin_3: 2;
    uint32_t pin_4: 2;
    uint32_t pin_5: 2;
    uint32_t pin_6: 2;
    uint32_t pin_7: 2;
    uint32_t pin_8: 2;
    uint32_t pin_9: 2;
    uint32_t pin_10: 2;
    uint32_t pin_11: 2;
    uint32_t pin_12: 2;
    uint32_t pin_13: 2;
    uint32_t pin_14: 2;
    uint32_t pin_15: 2;
} GPIOx_MODE_t;

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
